README.org
#+TITLE: Doom Configuration
#+author: Dan Girshovich
#+PROPERTY: header-args

* About
:PROPERTIES:
:ID:       0079bab1-003e-4b62-a4ba-471c108c2b3b
:END:

#+begin_quote
“I'm rarely happier than when spending an entire day programming my computer to perform automatically a task that would otherwise take me a good ten seconds to do by hand.” - Douglas Adams
#+end_quote

I use [[emacs.sexy][Emacs]] as the primary interface to my machine and remote machines. In many situations, it replaces CLIs or GUIs with well-designed keyboard-driven interfaces (e.g. [[https://magit.vc/][magit]]). There's no going back.

I use [[https://github.com/hlissner/doom-emacs/][Doom Emacs]] as a base Emacs configuration. This is a literate org file, which specifies and documents the entirety of my Doom configuration. If you link this file to =~/.doom.d/config.org=, Doom will automatically tangle it on startup and whenever it changes.

If you're reading this in a browser, consider opening it in Emacs Org mode for the full experience.

** Inspirations:

- [[https://github.com/jethrokuan/dots/tree/master/.doom.d][Jethro Kuan's dotfiles]]
- [[https://matthewbauer.us/bauer/][bauer: an Emacs+Nix IDE]]
- [[https://ambrevar.xyz/emacs-everywhere/][Pierre Neidhardt: Emacs Everywhere]]
- [[https://github.com/LemonBreezes/.doom.d/blob/master/config.org][LemonBreezes' Literate Doom Config]]
- [[https://zzamboni.org/post/my-emacs-configuration-with-commentary/][Diego Zamboni's Literate Emacs Config]]
- [[https://justin.abrah.ms/dotfiles/emacs.html][Justin Abrahms' Literate Emacs Config]]

* Table of Contents :QUOTE:TOC_3:
#+BEGIN_QUOTE
- [[#about][About]]
  - [[#inspirations][Inspirations:]]
- [[#doom-module-declarations][Doom Module Declarations]]
- [[#package-configuration][Package Configuration]]
  - [[#header][Header]]
  - [[#global-constants][Global Constants]]
    - [[#contact-info][Contact info]]
    - [[#directories][Directories]]
  - [[#hardware][Hardware]]
    - [[#brightness][Brightness]]
  - [[#load-helper-functions][Load helper functions]]
  - [[#visual-settings][Visual Settings]]
    - [[#theme][Theme]]
  - [[#key-chord-config][Key Chord Config]]
    - [[#enable-the-key-chord-package][Enable the key chord package]]
    - [[#setup-for-binding-chords-as-leaders][Setup for binding chords as leaders]]
    - [[#define-global-key-chords][Define global key-chords]]
  - [[#org][Org]]
    - [[#org-roam-graph-layer-on-top-of-org][org-roam: Graph layer on top of Org]]
    - [[#org-agenda][Org Agenda]]
    - [[#org-cliplink-better-external-links][org-cliplink: Better external links]]
  - [[#remote-machine-interfaces][Remote Machine Interfaces]]
    - [[#tramp][Tramp]]
    - [[#teleport][Teleport]]
  - [[#effective-editing][Effective Editing]]
    - [[#llms][LLMs]]
    - [[#structure-editing][Structure Editing]]
    - [[#multiple-cursors][Multiple Cursors]]
    - [[#undo-tree][Undo Tree]]
    - [[#topsy][topsy]]
  - [[#rust][Rust]]
  - [[#consult-bindings][Consult Bindings]]
  - [[#search-utilities][Search Utilities]]
    - [[#ctrlf][CtrlF]]
    - [[#better-grep][Better Grep]]
    - [[#scanning-occurances-within-a-buffer][Scanning occurances within a buffer]]
  - [[#version-control][Version Control]]
    - [[#magit][Magit]]
  - [[#dired][Dired]]
  - [[#window-management][Window Management]]
    - [[#avoiding-automatic-horizontal-splits][Avoiding Automatic Horizontal Splits]]
  - [[#registers][Registers]]
  - [[#load-untracked-elisp-work-specific][Load Untracked Elisp (work-specific)]]
  - [[#misc-global-keybindings][Misc Global Keybindings]]
  - [[#dont-save-passwords-to-clipboard-history][Don't save passwords to clipboard history]]
  - [[#misc][Misc]]
  - [[#autosave][Autosave]]
  - [[#better-expansions-with-fancy-dabbrev][Better Expansions with Fancy Dabbrev]]
- [[#utility-functions][Utility functions.]]
  - [[#resume][Resume]]
  - [[#org-1][Org]]
- [[#package-declarations][Package declarations]]
#+END_QUOTE

* Doom Module Declarations
:PROPERTIES:
:ID:       51ad662e-95d0-41bf-a17c-80f3b9ad6bb3
:END:

This file controls what Doom modules are enabled and what order they load in.
Remember to run =doom sync= or =doom/reload=  after modifying it.

#+begin_src emacs-lisp :tangle init.el
  ;;; init.el -*- lexical-binding: t; -*-

  (doom! :input

	 :personal
	 neurosys

	 :completion
	 (vertico +icons)

	 :ui
	 doom
	 modeline
	 zen

	 :editor
	 lispy
	 multiple-cursors
	 (format +onsave)

	 :emacs
	 dired
	 electric

	 :term
	 vterm

	 :checkers
	 syntax

	 :tools
         direnv
         docker
         magit
         (lsp +eglot)
         pass
         pdf
         tree-sitter

	 :lang
	 cc
	 data
	 emacs-lisp
	 ;; (go +lsp)
	 ;; javascript
	 ;; (haskell +dante)
	 ;; (julia +lsp)
	 (latex +latexmk +cdlatex)
	 markdown
	 nix
	 (org +roam2)
	 python
	 ;; rest
         (rust +lsp)
	 sh
	 yaml

	 :config
	 literate
	 (default +bindings))
#+end_src

* Package Configuration
:PROPERTIES:
:header-args: :tangle config.el
:END:

** Header

:PROPERTIES:
:ID:       9bb29ab5-3376-4e2f-b2b0-afba1d83b951
:END:
Set =lexical-binding= for this file.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Global Constants
*** Contact info
:PROPERTIES:
:ID:       37cd9dae-945d-4995-a256-7d2a5e0fec33
:END:

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp
(setq user-full-name "Dan Girshovich"
      user-mail-address (rot13 "qna.tvefu@tznvy.pbz"))
#+end_src

*** Directories
:PROPERTIES:
:ID:       7bded30b-eb12-414d-adcc-793d332992ed
:END:

#+begin_src emacs-lisp
(setq my/home-dir "/home/dan/")

(setq my/sync-base-dir (concat my/home-dir "Sync/"))
(setq my/work-base-dir (concat my/home-dir "Work/"))
(setq my/media-base-dir (concat my/home-dir "Media/"))
#+end_src

#+RESULTS:
: /home/dan/Media/

**** Org
:PROPERTIES:
:ID:       a8ee5123-de16-4100-8f61-4254ad41a35a
:END:

#+begin_src emacs-lisp
(setq org-directory my/sync-base-dir
      org-roam-directory "/home/dan/Sync/org-roam2/"
      org-roam-db-location (concat org-roam-directory "org-roam.db")
      my/org-roam-todo-file (concat org-roam-directory "orgzly/todo.org"))

(save-window-excursion
  (find-file my/org-roam-todo-file)
  (save-buffer))
#+end_src

#+RESULTS:
: /home/dan/Sync/org-roam/

** Hardware

*** Brightness

#+begin_src emacs-lisp
(setq my/brightness-min 1)
(setq my/brightness-max 100)
(setq my/brightness-step 5)

(defun my/set-brightness (level)
  (interactive "nBrightness level: ")
  (let ((safe-level
         (cond ((< level my/brightness-min) my/brightness-min)
               ((> level my/brightness-max) my/brightness-max)
               (t level))))
    (save-window-excursion
      (shell-command
       (format "sudo light -S %s" safe-level) nil nil))))
#+end_src

#+RESULTS:
: my/set-brightness

** Load helper functions
:PROPERTIES:
:ID:       7b5b7825-c637-4def-ab9b-c7c0adc07e51
:END:

#+begin_src emacs-lisp
(load-file (concat doom-private-dir "funcs.el"))
#+end_src

** Visual Settings
:PROPERTIES:
:ID:       c19e07c7-9f80-4b3d-9316-1a7e03e7886e
:END:

#+begin_src emacs-lisp
(setq
 doom-font (font-spec :family "Iosevka" :size 22)
 doom-variable-pitch-font (font-spec :family "Libre Baskerville")
 doom-serif-font (font-spec :family "Libre Baskerville"))

(setq display-line-numbers-type nil)

;; Thin grey line separating windows
(set-face-background 'vertical-border "grey")
(set-face-foreground 'vertical-border (face-background 'vertical-border))
#+end_src

*** Theme
:PROPERTIES:
:ID:       962674ce-6327-446e-9000-c820d7b3f885
:END:

#+begin_src emacs-lisp
(use-package! doom-themes
  :config
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-one t)
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

#+RESULTS:
: t

** Key Chord Config

I don't use Evil (Vim emulation), which would add an extra layer of complexity
to /everything./ Instead, I heavily leverage key-chord.el, which enables binding
simultaneous key presses (chords) to commands.

I have some custom code to bind chords to Doom's leaders. Many commonly used
commands are bound in these "key chord maps".

*** Enable the key chord package
:PROPERTIES:
:ID:       9d6f7721-18d3-4487-8128-235c11fe4988
:END:

Set hardware-specific delay. Tweak this if:

- there are false keychords triggered when typing fast (delay too large)
- if expected keychords don't register (delay too small)
- there's a noticable lag when typing normally (delay too large)

#+begin_src emacs-lisp
(use-package! key-chord
  :config
  (key-chord-mode 1)
  (setq key-chord-one-key-delay 0.20 ; same key (e.g. xx)
        key-chord-two-keys-delay 0.1)
  (customize-set-variable 'key-chord-safety-interval-forward 0.0)
  (customize-set-variable 'key-chord-safety-interval-backward 0.0))
#+end_src

#+RESULTS:
: t

*** Setup for binding chords as leaders
:PROPERTIES:
:ID:       149caf22-cf26-419e-91fe-8927a664eb85
:END:

#+begin_src emacs-lisp
(defun simulate-seq (seq)
  (setq unread-command-events (listify-key-sequence seq)))

(defun send-doom-leader ()
  (interactive)
  (simulate-seq "\C-c"))

(setq doom-localleader-alt-key "M-c")

(defun send-doom-local-leader ()
  (interactive)
  (simulate-seq "\M-c"))

#+end_src

*** Define global key-chords
:PROPERTIES:
:ID:       dd47cb54-9c47-48fe-b38e-358b89558fcb
:END:

https://gist.github.com/dangirsh/86c001351c02b42321d20f462a66da6b

#+begin_src emacs-lisp
(after! key-chord
  ;; My external keyboard (Voyager) supports chords in the firmware
  ;; For some cases, I find it less error prone to use these instead of
  ;; keychord.el. In these cases, the keyboard sends a function key (e.g. f13)

  (key-chord-define-global "pl" 'send-doom-leader)
  ;; (global-set-key (kbd "<XF86Launch7>") 'send-doom-leader)
  (key-chord-define-global "bj" 'send-doom-local-leader)

  (setq dk-keymap (make-sparse-keymap))

  (key-chord-define-global "fu" dk-keymap)
  ;; (global-set-key (kbd "<XF86Tools>") dk-keymap)

  (defun add-to-keymap (keymap bindings)
    (dolist (binding bindings)
      (define-key keymap (kbd (car binding)) (cdr binding))))

  (defun add-to-dk-keymap (bindings)
    (add-to-keymap dk-keymap bindings))

  (add-to-dk-keymap
   '(("." . jump-to-register)
     ("<SPC>" . rgrep)
     ("a" . my/org-agenda)
     ("b" . my/set-brightness)
     ("c" . my/open-literate-private-config-file)
     ("d" . dired-jump)
     ("k" . doom/kill-this-buffer-in-all-windows)
     ("m" . magit-status)
     ("n" . narrow-or-widen-dwim)
     ("s" . save-buffer)
     ("t" . +vterm/here)
     ("v" . neurosys/open-config-file)
     ("w" . google-this-noconfirm)))

  (key-chord-define-global ",." 'end-of-buffer)
  (key-chord-define-global "xc" 'beginning-of-buffer)
  (key-chord-define-global "zx" 'beginning-of-buffer)

  (key-chord-define-global "qw" 'delete-window)
  (key-chord-define-global "q;" 'delete-other-windows)
  (key-chord-define-global ",," 'doom/open-scratch-buffer)

  (key-chord-define-global "pu" 'other-window)
  (key-chord-define-global "fl" 'rev-other-window)

  (key-chord-define-global "dh" 'split-window-vertically-and-switch)
  (key-chord-define-global "mn" 'split-window-horizontally-and-switch)

  (key-chord-define-global "nh" 'my/duplicate-line-or-region)
  (key-chord-define-global "td" 'comment-line)

  (key-chord-define-global "uy" 'er/expand-region)

  (key-chord-define-global "xx" 'execute-extended-command)
  (key-chord-define-global "xt" 'ffap))
#+end_src

#+RESULTS:
: ffap

