README.org
** Consult Bindings
:PROPERTIES:
:ID:       21b80d84-22d0-4c51-bd9b-df794f575eb9
:END:

#+begin_src emacs-lisp
(map! :map vertico-map
      "C-SPC" #'+vertico/embark-preview)

(use-package! consult
  :bind
  ;; swiper muscle-memory
  ("M-s l" . consult-line))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(add-to-dk-keymap
 '(("<SPC>" . deadgrep)
   ;; Project content search. ripgrep automatically understands .gitignore
   ("g" . consult-ripgrep)
   ;; Project file search.
   ("j" . consult-projectile)
   ("i" . consult-imenu)
   ("l" . consult-buffer)))

(global-set-key [remap yank-pop] 'consult-yank-pop)
#+end_src

** Search Utilities

*** CtrlF

#+begin_src emacs-lisp
(use-package! ctrlf
  :init
  (ctrlf-mode +1))
#+end_src

*** Better Grep
:PROPERTIES:
:ID:       958328c0-f6fb-4515-954d-6a1428ae7f70
:END:

#+BEGIN_SRC emacs-lisp
(use-package! deadgrep)
#+END_SRC

Edit results with =deadgrep-edit-mode= (replaces wgrep). Save changes with =save-some-buffers= (=C-x s !=).

*** Scanning occurances within a buffer
:PROPERTIES:
:ID:       54d5efa9-5b0e-4461-963f-eeb5e8ddebfa
:END:

This is one of my primary ways of navigating next: jump through other occurances
of the text currently under the cursor.

#+BEGIN_SRC emacs-lisp
(use-package! smartscan
  :init (global-smartscan-mode 1)
  :bind (("M-N" . smartscan-symbol-go-forward)
         ("M-P" . smartscan-symbol-go-backward)
         :map smartscan-map
         ("M-p" . nil)
         ("M-n" . nil)))
#+END_SRC

** Version Control
:PROPERTIES:
:ID:       50c4c552-206f-4a95-a543-2278c64639e4
:END:

Disable version control when using TRAMP to avoid extra delays

#+BEGIN_SRC emacs-lisp
(setq vc-ignore-dir-regexp
                (format "\\(%s\\)\\|\\(%s\\)"
                        vc-ignore-dir-regexp
                        tramp-file-name-regexp))
#+END_SRC

*** Magit
:PROPERTIES:
:ID:       51cdd812-4ae4-4e27-8418-c8983c77a5f3
:END:

Stunningly useful.

#+BEGIN_SRC emacs-lisp
(use-package! magit
  :config
  (set-default 'magit-stage-all-confirm nil)
  (set-default 'magit-unstage-all-confirm nil)

  (remove-hook 'magit-mode-hook 'turn-on-magit-gitflow)

  ;; Restores "normal" behavior in branch view (when hitting RET)
  (setq magit-visit-ref-behavior '(create-branch checkout-any focus-on-ref))

  (setq git-commit-finish-query-functions nil)
  (setq magit-visit-ref-create 1)
  (setq magit-revision-show-gravatars nil))
#+END_SRC

** Dired
:PROPERTIES:
:ID:       bb2652cb-665e-4835-89b5-cd5d16254186
:END:

#+BEGIN_SRC emacs-lisp
(setq dired-omit-extensions nil)

(after! dired
  (remove-hook 'dired-mode-hook 'dired-omit-mode)
  (setq dired-listing-switches "-aBhlv --group-directories-first"
        dired-dwim-target t
        dired-recursive-copies (quote always)
        dired-recursive-deletes (quote top)
        ;; Directly edit permisison bits!
        wdired-allow-to-change-permissions t))

(use-package! dired-rsync
  :bind (:map dired-mode-map
              ("C-c C-r" . dired-rsync)))

(use-package! dired-x)

;; Directly edit permission bits!
(setq wdired-allow-to-change-permissions t)
#+END_SRC

#+RESULTS:
: t

** Window Management
*** Avoiding Automatic Horizontal Splits
:PROPERTIES:
:ID:       557a7e58-0457-47af-a2bf-eb77e46ce360
:END:

#+begin_src emacs-lisp
;; prevents horizontal splits when split-window-sensibly is used
(setq split-width-threshold nil)
#+end_src

*** COMMENT Jumping between windows
:PROPERTIES:
:ID:       bd0213d6-ab2d-4172-a463-ae752837cedb
:END:

Here we set the window labels to homerow keys (they are numbers by default)

Would use the window-select Doom module, but that (unwantedly in EXWM) binds other-window
to ace-window.

#+begin_src emacs-lisp
(use-package! ace-window
  :config
  (map! "C-M-SPC" #'ace-window)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src

*** COMMENT Saving Window Configurations
:PROPERTIES:
:ID:       22e0fde9-8b3b-4200-a3a2-ddef158b4c96
:END:

#+begin_src emacs-lisp
(use-package! burly)
#+end_src

** Registers
:PROPERTIES:
:ID:       aebbfcb7-7c2c-4e95-a21d-b9f3d9491392
:END:

#+begin_src emacs-lisp
(delete 'register-alist savehist-additional-variables)

(set-register ?h '(file . "~/Sync/home/config.org"))
(set-register ?r '(file . "~/Sync/resume/resume.tex"))
#+end_src

#+RESULTS:
: (file . ~/Sync/resume/resume.tex)

** Load Untracked Elisp (work-specific)
:PROPERTIES:
:ID:       52472b2d-ec59-4629-88c6-83dcab02b49e
:END:

Load extra work config if the environment variable =EMACS_WORK_MODE= is set.

#+begin_src emacs-lisp
(unless (getenv "EMACS_NON_WORK_MODE")
  (load-file "/home/dan/Work/w/emacs/work-config.el")
  (require 'work-config))
#+end_src

** Misc Global Keybindings
:PROPERTIES:
:ID:       fe4a8869-cdb4-4790-9a3a-e02deaece17b
:END:

#+BEGIN_SRC emacs-lisp
(map!
 "M-p" (lambda () (interactive) (scroll-down 4))
 "M-n" (lambda () (interactive) (scroll-up 4))

 "C-h h" 'helpful-at-point
 "C-h f" 'helpful-function
 "C-h v" 'helpful-variable
 "C-h k" 'helpful-key

 "M-SPC" 'avy-goto-word-or-subword-1

 "C-S-d" 'my/duplicate-line-or-region
 "C-c <left>" 'winner-undo
 "C-c <right>" 'winner-redo

 "C-+" 'text-scale-increase
 "C--" 'text-scale-decrease

 "C-<f5>" 'my/night-mode
 "C-<f6>" 'my/day-mode

 "C-z"   'undo-fu-only-undo
 "C-S-z" 'undo-fu-only-redo

 "C-/"   'undo-fu-only-undo
 "C-?" 'undo-fu-only-redo
 "C-x C-z" nil)
  ;; remove binding for suspend-frame
;; (global-set-key [remap goto-line] 'goto-line-with-feedback)
;; (global-set-key [remap goto-line] 'goto-line-with-feedback)

#+END_SRC

** Don't save passwords to clipboard history
:PROPERTIES:
:ID:       8eebe3fb-e3a8-4704-9825-8220b53982ae
:END:

#+begin_src emacs-lisp
(defun pause-greenclip-daemon ()
  (shell-command "ps axf | grep 'greenclip daemon' | grep -v grep | awk '{print $1}' | xargs kill -20"))

(defun resume-greenclip-daemon ()
  (shell-command "greenclip print ' ' && ps axf | grep 'greenclip daemon' | grep -v grep | awk '{print $1}' | xargs kill -18"))

(defadvice password-store-copy (around pause-and-resume-greenclip activate)
  "Pause the greenclip daemon before saving the password to the kill ring, then resume the daemon after saving."
  (pause-greenclip-daemon)
  ad-do-it
  (run-with-idle-timer 10 1 #'resume-greenclip-daemon)
  )

#+end_src

#+RESULTS:
: password-store-copy

** Misc
:PROPERTIES:
:ID:       84c57526-9ea1-4c89-b247-084651330d97
:END:
#+begin_src emacs-lisp
(doom/open-scratch-buffer nil nil t)

(set-company-backend! 'text-mode nil)

(defun my/file-local-p (f)
  (not (file-remote-p f)))

(after! recentf
  (add-to-list 'recentf-keep 'my/file-local-p))
;; (setq warning-minimum-level :emergency)

;; (when doom-debug-p
;;   (require 'benchmark-init)
;;   (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))

(setq async-shell-command-buffer 'new-buffer)

; (add-to-list 'auto-mode-alist '("\\.eps\\'" . doc-view-minor-mode))

;; all backup and autosave files in the tmp dir
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

;; Coordinate between kill ring and system clipboard
(setq save-interprogram-paste-before-kill t)

;; (setq eshell-history-file-name (concat doom-private-dir "eshell-history"))

;; This is dangerous, but reduces the annoying step of confirming local variable settings each time
;; a file with a "Local Variables" clause (like many Org files) is opened.
(setq-default enable-local-variables :all)

;; This is usually just annoying
(setq compilation-ask-about-save nil)

;; No confirm on exit
(setq confirm-kill-emacs nil)

;; Alternative to calling save-buffers-kill-emacs, since
;; a) Muscle memory sends me to "kill-emacs" via fj-q-q
;; b) save-buffers-kill-emacs sometimes fails
;; This way, we try to save things, but quit in any case.
(defun my/save-ignore-errors ()
  (ignore-errors
    (save-some-buffers)))

(add-hook 'kill-emacs-hook 'my/save-ignore-errors)


;; Help out Projectile for remote files via TRAMP
;; https://sideshowcoder.com/2017/10/24/projectile-and-tramp/
(defadvice projectile-on (around exlude-tramp activate)
  "This should disable projectile when visiting a remote file"
  (unless  (--any? (and it (file-remote-p it))
                   (list
                    (buffer-file-name)
                    list-buffers-directory
                    default-directory
                    dired-directory))
 mad-do-it))

(setq projectile-mode-line "Projectile")

(setq password-store-password-length 20)

;; Truncate compiilation buffers, otherwise Emacs gets slow
;; https://stackoverflow.com/questions/11239201/can-i-limit-the-length-of-the-compilation-buffer-in-emacs
(add-hook 'compilation-filter-hook 'comint-truncate-buffer)
(setq comint-buffer-maximum-size 2000)

(setq recentf-max-saved-items 10000)

(after! vterm
  (setq vterm-max-scrollback 100000
        vterm-copy-exclude-prompt t))
(customize-set-variable 'vterm-buffer-name-string nil)

;; Emacs 28: Hide commands in M-x which do not work in the current mode.
;; Vertico commands are hidden in normal buffers.
(setq read-extended-command-predicate
      #'command-completion-default-include-p)

(defun crm-indicator (args)
  (cons (concat "[CRM] " (car args)) (cdr args)))


(advice-add #'completing-read-multiple :filter-args #'crm-indicator)

(defun my-compilation-mode-hook ()
  (visual-line-mode 1))

(add-hook 'compilation-mode-hook 'my-compilation-mode-hook)
#+end_src

#+RESULTS:
: t

** Autosave
:PROPERTIES:
:ID:       a1c6fcc8-9127-4ee1-a7b0-75d62d032c23
:END:

#+begin_src emacs-lisp
(use-package! real-auto-save
  :hook
  (prog-mode . real-auto-save-mode)
  (org-mode . real-auto-save-mode))
#+end_src

** Better Expansions with Fancy Dabbrev
:PROPERTIES:
:ID:       e3758501-6b3d-4cb7-aaa0-49137b8d6c0c
:END:


#+begin_src emacs-lisp
(use-package! fancy-dabbrev
  :hook
  (prog-mode . fancy-dabbrev-mode)
  (org-mode . fancy-dabbrev-mode)
  :config
  ;; (setq fancy-dabbrev-preview-delay 0.1)
  (setq fancy-dabbrev-preview-context 'before-non-word)
  ;; Let dabbrev searches ignore case and expansions preserve case:
  (setq dabbrev-case-distinction nil)
  (setq dabbrev-case-fold-search t)
  (setq dabbrev-case-replace nil)
  (add-hook 'minibuffer-setup-hook (lambda () (fancy-dabbrev-mode 0)))
  (add-hook 'minibuffer-exit-hook (lambda () (fancy-dabbrev-mode 1))))
#+end_src

